tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
  }

  return ESP32_TARGZ_OK;
}





int TarUnpacker::tarEndCallBack( TAR::header_translated_t *header, CC_UNUSED int entry_index, CC_UNUSED void *context_data)
{
  int ret = ESP32_TARGZ_OK;

  if( untarredFile ) {
    if( unTarDoHealthChecks ) {
      memset( tar_file_path, 0, 256 );
      snprintf( tar_file_path, 256, "%s", targzFSFilePath(&untarredFile) );
      size_t pos = untarredFile.position();
      untarredFile.close();
      // health check 1: file existence
      if( !tarFS->exists( tar_file_path ) ) {
        log_e("[TAR ERROR] File %s was not created although it was properly decoded, path is too long ?", tar_file_path );
        return ESP32_TARGZ_FS_WRITE_ERROR;
      }
      // health check 2: compare stream buffer position with speculated file size
      if( pos != header->filesize ) {
        log_e("[TAR ERROR] File size and data size do not match (%d vs %d)!", (int)pos, (int)header->filesize);
        return ESP32_TARGZ_FS_WRITE_ERROR;
      }
      // health check 3: reopen file to check size on filesystem
      untarredFile = tarFS->open(tar_file_path, FILE_READ);
      size_t tmpsize = untarredFile.size();
      if( !untarredFile ) {
        log_e("[TAR ERROR] Failed to re-open %s for size reading", tar_file_path);
        return ESP32_TARGZ_FS_READSIZE_ERROR;
      }
      // health check 4: see if everyone (buffer, stream, filesystem) agree
      if( (header->filesize>0 && tmpsize == 0) || header->filesize != tmpsize || pos != tmpsize ) {
        log_e("[TAR ERROR] Byte sizes differ between written file %s (%d), tar headers (%d) and/or stream buffer (%d) !!", tar_file_path, (int)tmpsize, (int)header->filesize, (int)pos );
        untarredFile.close();
        return ESP32_TARGZ_FS_ERROR;
      }
      log_d("Expanded %s (%d bytes)", tar_file_path, (int)tmpsize );
    }

    untarredFile.close();

    tarTotalSize = 0;
    if( header->type != TAR::T_DIRECTORY ) {
      tarTotalSize += header->filesize;
    }

    tarProgressCallback( 100 );
    log_d("Total expanded bytes: %d, heap free: %d", (int)tarTotalSize, HEAP_AVAILABLE() );

    tarMessageCallback( "%s", header->filename );

  } else {
    if( tarSkipThisEntry ) {
      log_v("[TAR FILTER] Skipped file close for: %s.", header->filename);
    } else {
      log_v("[TAR INFO] tarEndCallBack: nofile for `%s`", header->filename );
    }
  }
  totalFiles++;

  return ret;
}



#if defined HAS_OTA_SUPPORT

  int TarUnpacker::tarHeaderUpdateCallBack(TAR::header_translated_t *header,  int entry_index,  void *context_data)
  {
    dump_header(header);

    // https://github.com/tobozo/ESP32-targz/issues/33
    if( header->type == TAR::T_NORMAL  || header->type == TAR::T_EXTENDED ) {

      int partition = -1;

      if( String( header->filename ).endsWith("ino.bin") ) {
        // partition = app
        partition = U_FLASH;
      } else if( String( header->filename ).endsWith("spiffs.bin")
              || String( header->filename ).endsWith("littlefs.bin")
              || String( header->filename ).endsWith("ffat.bin")  ) {
        partition = U_PART;
      } else {
        // not relevant to Update
        // TODO: provide action callbacks (e.g. file has meta info)
        return ESP32_TARGZ_OK;
      }

      // check that header->filesize is smaller than partition available size
      if( !Update.begin( header->filesize/*UPDATE_SIZE_UNKNOWN*/, partition ) ) {
        setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
        return (Update.getError()-20);
      }

      tarCurrentFileSize = header->filesize; // for progress
      tarCurrentFileSizeProgress = 0; // for progress
      tarBlockIsUpdateData = true;

      tarTotalSize += header->filesize;
      if( tarStatusProgressCallback ) {
        tarStatusProgressCallback( header->filename, header->filesize, tarTotalSize );
      }
      if( tarTotalSize == header->filesize )
        tarProgressCallback( 0 );

    }/* else {

      switch( header->type ) {
        case TAR::T_HARDLINK:       log_d("Ignoring hard link to %s.", header->filename); break;
        case TAR::T_SYMBOLIC:       log_d("Ignoring sym link to %s.", header->filename); break;
        case TAR::T_CHARSPECIAL:    log_d("Ignoring special char."); break;
        case TAR::T_BLOCKSPECIAL:   log_d("Ignoring special block."); break;
        case TAR::T_DIRECTORY:      log_d("Entering %s directory.", header->filename);
          //tarMessageCallback( "Entering %s directory\n", header->filename );
          if( tarStatusProgressCallback ) {
            tarStatusProgressCallback( header->filename, 0, tarTotalSize );
          }
          totalFolders++;
        break;
        case TAR::T_FIFO:           log_d("Ignoring FIFO request."); break;
        case TAR::T_CONTIGUOUS:     log_d("Ignoring contiguous data to %s.", header->filename); break;
        case TAR::T_GLOBALEXTENDED: log_d("Ignoring global extended data."); break;
        case TAR::T_EXTENDED:       log_d("Ignoring extended data."); break;
        case TAR::T_OTHER: default: log_d("Ignoring unrelevant data.");       break;
      }

    }*/

    return ESP32_TARGZ_OK;
  }


  int TarUnpacker::tarEndUpdateCallBack( TAR::header_translated_t *header, int entry_index, void *context_data)
  {
    int ret = ESP32_TARGZ_OK;

    if ( !Update.end( true ) ) {
      Update.printError(Serial);
      log_e( "Update Error Occurred. Error #: %u", Update.getError() );
      setError( (tarGzErrorCode)(Update.getError()-20) ); // "-20" offset is Update error id to esp32-targz error id
      return (Update.getError()-20);
    }

    if ( !Update.isFinished() ) {
      log_e("Update incomplete");
      setError( ESP32_TARGZ_UPDATE_INCOMPLETE );
      return ESP32_TARGZ_UPDATE_INCOMPLETE;
    }

    log_d("Update finished !");
    Update.end();

    tarBlockIsUpdateData = false;
    tarProgressCallback( 100 );
    //log_d("Total expanded bytes: %d, heap free: %d", (int)tarTotalSize, HEAP_AVAILABLE() );
    tarMessageCallback( "%s", header->filename );
    totalFiles++;

    return ret;
  }



  int TarUnpacker::tarStreamWriteUpdateCallback(TAR::header_translated_t *header, int entry_index, void *context_data, unsigned char *block, int length)
  {
    if( tarBlockIsUpdateData ) {
      int wlen = Update.write( block, length );
      if( wlen != length ) {
        //tgzLogger("\n");
        log_e("[TAR ERROR] Written length differs from buffer length (unpacked bytes:%d, expected: %d, returned: %d)!\n", untarredBytesCount, length, wlen );
        return ESP32_TARGZ_FS_ERROR;
      }
      untarredBytesCount+=wlen;
      // file unpack progress
      log_v("[TAR INFO] tarStreamWriteCallback wrote %d bytes to %s", length, header->filename );
      tarCurrentFileSizeProgress += wlen;
      if( tarCurrentFileSize > 0 ) {
        // this is a per-file progress, not an overall progress !
        int32_t progress = (100*tarCurrentFileSizeProgress) / tarCurrentFileSize;
        if( progress != 100 && progress != 0 ) {
          tarProgressCallback( progress );
        }
      }
    }
    return ESP32_TARGZ_OK;
  }

#endif



