tobozo/ESP32-targz/src/libunpacker/LibUnpacker.cpp
    return tarGzExpanderNoTempFile( sourceFS, sourceFile, destFS, destFolder );
  }
}


#if defined HAS_OTA_SUPPORT

  bool TarGzUnpacker::tarGzStreamUpdater( Stream *stream )
  {
    if( !stream->available() ) {
      log_e("Bad stream, aborting");
      setError( ESP32_TARGZ_STREAM_ERROR );
      return false;
    }
    if( !gzProgressCallback ) {
      setGzProgressCallback( defaultProgressCallback );
    }
    tarGzIO.gz = stream;
    tarFS = nullptr;
    untarredBytesCount = 0;
    gzTarBlockPos = 0;

    tarCallbacks = {
      tarHeaderUpdateCallBack,
      gzFeedTarBuffer,
      tarStreamWriteUpdateCallback,
      tarEndUpdateCallBack
    };

    TAR::tar_error_logger      = tgzLogger; // targzPrintLoggerCallback or tgzLogger
    TAR::tar_debug_logger      = tgzLogger; // comment this out if too verbose

    if( gzWriteCallback == nullptr ) {
      setStreamWriter( gzProcessTarBuffer );
    }
    //gzWriteCallback = &gzProcessTarBuffer;

    totalFiles = 0;
    totalFolders = 0;

    firstblock = true; // trigger TAR setup from gzUncompress callback
    lastblock  = false;

    bool isupdate      = true;
    bool stream_to_tar = false;
    bool use_dict      = true;
    bool show_progress = false;

    int ret = gzUncompress( isupdate, stream_to_tar, use_dict, show_progress );

    if( ret!=0 ) {
      log_e("gzUncompress returned error code %d", ret);
      setError( (tarGzErrorCode)ret );
      return false;
    }

    return true;

  }

#endif // defined HAS_OTA_SUPPORT


// uncompress tar+gz stream (file or HTTP) to filesystem without intermediate tar file
bool TarGzUnpacker::tarGzStreamExpander( Stream *stream, fs::FS &destFS, const char* destFolder, int64_t streamSize )
{
  if( nodict == true ) { // leave 1k heap for the stack
    log_e("[GZ] Function explicely disabled by ::noDict()" );
    setError( ESP32_TARGZ_HEAP_TOO_LOW );
    return false;
  }

  bool isupdate      = false;
  bool stream_to_tar = false;
  bool use_dict      = true; // mandatory for stream to stream, no temp file = checksum+seek unavailable !!
  bool show_progress = false;

  // size was provided when passing the stream, enable progress
  if( streamSize > 0 ) {
    tarGzIO.gz_size = streamSize;
    stream_bytesleft = streamSize;
    show_progress = true;
    log_w("Enabling progress");
  }

  if( !stream->available() ) {
    log_e("Bad stream, aborting");
    setError( ESP32_TARGZ_STREAM_ERROR );
    return false;
  }

  if( !gzProgressCallback ) {
    show_progress = false;
    setGzProgressCallback( defaultProgressCallback );
  }

  tarGzIO.gz = stream;

  tarFS = &destFS;
  tarDestFolder = destFolder;
  if( !tarProgressCallback ) {
    setTarProgressCallback( tarNullProgressCallback );
  }
  if( !tarMessageCallback ) {
    setTarMessageCallback( targzNullLoggerCallback );
  }
  if( !destFS.exists( tarDestFolder ) ) {
    destFS.mkdir( tarDestFolder );
  }

  untarredBytesCount = 0;
  gzTarBlockPos = 0;

  tarCallbacks = {
    tarHeaderCallBack,
    gzFeedTarBuffer,
    tarStreamWriteCallback,
    tarEndCallBack
  };

  TAR::tar_error_logger      = tgzLogger; // targzPrintLoggerCallback or tgzLogger
  TAR::tar_debug_logger      = tgzLogger; // comment this out if too verbose

  //if( gzWriteCallback == nullptr ) {
    setStreamWriter( gzProcessTarBuffer );
  //}
  //gzWriteCallback = &gzProcessTarBuffer;

  totalFiles = 0;
  totalFolders = 0;

  firstblock = true; // trigger TAR setup from gzUncompress callback
  lastblock  = false;



  #if defined ESP8266 || defined ARDUINO_ARCH_RP2040

    min_output_buffer_size = 1024;

    int dict_available_heap = (HEAP_AVAILABLE()-(GZIP_DICT_SIZE+GZIP_BUFF_SIZE+min_output_buffer_size));

    // check minimal ram for gzip+tar
    if( dict_available_heap < 1024 ) { // leave 1k heap for the stack
      log_e("[GZ] not enough heap, available: %d, needed: %d :-(", HEAP_AVAILABLE(), GZIP_DICT_SIZE+GZIP_BUFF_SIZE+min_output_buffer_size );
      setError( ESP32_TARGZ_HEAP_TOO_LOW );
      return false;
    }

    blockmod = min_output_buffer_size / TAR_BLOCK_SIZE; // adjust gz->tar buffered block modulo
    if(tgzLogger )
      tgzLogger("tarGzStreamExpander will unpack stream to %s folder using %d buffered bytes and %s dictionary\n", destFolder, min_output_buffer_size, use_dict ? "36Kb for the" : "NO" );

  #endif

  int ret = gzUncompress( isupdate, stream_to_tar, use_dict, show_progress );

  if( ret!=0 ) {
    log_e("tarGzStreamExpander returned error code %d", ret);
    setError( (tarGzErrorCode)ret );
    return false;
  }

  return true;
}




#if defined ESP32 && defined HAS_OTA_SUPPORT

  /**    GzUpdateClass Class implementation    **/

  bool GzUpdateClass::begingz(size_t size, int command, int ledPin, uint8_t ledOn, const char *label)
  {
    if( !gzProgressCallback ) {
      log_d("Setting progress cb");
      gzUnpacker.setGzProgressCallback( gzUnpacker.defaultProgressCallback );
    }
    if( !tgzLogger ) {
      log_d("Setting logger cb");
      gzUnpacker.setLoggerCallback( gzUnpacker.targzPrintLoggerCallback );
    }
    if( gzWriteCallback == nullptr ) {
      log_d("Setting write cb");
      gzUnpacker.setStreamWriter( this->gzUpdateWriteCallback );
    }

    mode_gz = true;

    bool ret = begin(size, command, ledPin, ledOn, label);

    return ret;
  }



  bool GzUpdateClass::gzUpdateWriteCallback( unsigned char* buff, size_t buffsize )
  {
    int written = GzUpdateClass::getInstance().write( buff, buffsize );
    if( written ) {
      log_v("Wrote %d bytes", written );
      return true;
    }
    log_e("Failed to write %d bytes", buffsize );
    return false;
  }


  void GzUpdateClass::abortgz()
  {
    abort();
    gzUnpacker.gzExpanderCleanup();
    mode_gz = false;
  }


  bool GzUpdateClass::endgz(bool evenIfRemaining)
  {
    gzUnpacker.gzExpanderCleanup();
    mode_gz = false;
    return end(evenIfRemaining);
  }


  size_t GzUpdateClass::writeGzStream(Stream &data, size_t len)
  {
    if (!mode_gz) {
      log_d("Not in gz mode");
      return writeStream(data);
    }

    uint32_t timeout = millis() + targz_read_timeout;

    while( !data.available() ) {
      if(millis()>timeout) {
        log_e("stream still not responsive after %dms timeout, giving up", targz_read_timeout);
        return 0;
      }
      vTaskDelay(1);
    }

    log_d("In gz mode");

    tarGzIO.gz = &data;

    // process with decompressing
    int ret = gzUnpacker.gzUncompress( true/*isupdate*/, false/*stream_to_tar*/, true/*use_dict*/, false/*show_progress*/ );

    if( ret!=0 ) {
      log_e("gzUncompress returned error code %d (free heap=%d bytes)", ret, HEAP_AVAILABLE() );
      //gzUnpacker.setError( (tarGzErrorCode)ret );
      return 0;
    }

    //log_d("unpack complete (%d bytes)", use_dict ? tarGzIO.gz_size : GzUpdateClass_Write_Offset );
    // TODO: return actual uncompressed length

    return len;
  }

#endif // #if defined ESP32 && defined HAS_OTA_SUPPORT


